core/src/main/resources/order_template/act_rolling.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{2}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{3}</OrderUserId>
         <OrderDateTime>{1}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODPCS</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{2}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
               <OrderItemCode/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SERVICE</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>SERVICE{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <OrderItemCode/>
               <Attributes>
                  <Attribute>
                     <Name>ServiceId</Name>
                     <Value>PCS</Value>
                  </Attribute>                          
                  <Attribute>
                     <Name>pricingPlan</Name>
                     <Value>{4}</Value>
                  </Attribute>                 
               </Attributes>
            </OrderItem>
         </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>